In [7]:
#Agrupación de datos por columna
import numpy as np
import pandas as pd

In [14]:
dictionary = {"dias": ['dia1', "dia1", "dia2", "dia2",  "dia3"], "vendedores": ["Antonio", "Maria", "Jose", "Marta", "Juan"], 
              "ventas": [100, 400, 500, 300, 200]}

In [17]:
dataframe = pd.DataFrame(dictionary)
dataframe

   dias vendedores  ventas
0  dia1    Antonio     100
1  dia1      Maria     400
2  dia2       Jose     500
3  dia2      Marta     300
4  dia3       Juan     200

In [21]:
dataframe.groupby("dias").mean() #Establecer la media de valores

      ventas
dias
dia1   250.0
dia2   400.0
dia3   200.0

In [24]:
dataframe.groupby("dias").sum() #Establecer la suma de valores

      ventas
dias
dia1     500
dia2     800
dia3     200

In [40]:
dataframe.groupby("dias").describe() #Esteblecer unas estadisticas con los datos más habituales

     ventas
      count   mean         std    min    25%    50%    75%    max
dias
dia1    2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
dia2    2.0  400.0  141.421356  300.0  350.0  400.0  450.0  500.0
dia3    1.0  200.0         NaN  200.0  200.0  200.0  200.0  200.0